{"id":1,"copied_from":"https://codersblock.com/blog/external-links-new-tabs-and-accessibility/","components":[{"type":"headline","subtype":"h1","text":"External Links, New Tabs, and Accessibility"},{"type":"text","text":"Let’s talk about making your site’s external links open in a new tab. First we’ll consider if this is even a good idea, then we’ll look at ways to improve the accessibility of these links."},{"type":"media","sub_type":"image","url":"https://codersblock.com/static/external-windows-9bff4e9c460be02a5a9c9393aaace64b.jpg"},{"type":"headline","sub_type":"h2","text":"Should External Links Open in a New Tab?"},{"type":"html","text":"Somewhere along the way, I learned to open external links in a new tab. If a link pointed to something not on the current domain, it got a <code>target=\"_blank\"</code> slapped on it. I know I’m not alone here — many of my fellow web developers do this. I thought it was convention."},{"type":"html","text":"But not everyone agrees. There are smart folks out there arguing against the idea, as you can see in this article by Chris Coyier and <a>this article by Vitaly Friedman</a>. They’ve got some good points, which I won’t rehash here. Instead, I want to focus on one particular reason to not open external links in a new tab: accessibility."},{"type":"headline","sub_type":"h2","text":"Accessibility Implications"},{"type":"html","text":"With regards to accessibility, <a>the W3C recommends against opening links in a new tab.</a>"},{"type":"quote","properties":["italic"],"text":"“In general, it is better not to open new windows and tabs since they can be disorienting for people, especially people who have difficulty perceiving visual content.”"},{"type":"text","text":"Consider a user that doesn’t know/understand that they’re now in a different tab. They hit their trusty “back” keyboard shortcut to return to the previous page, but nothing happens. Not a great experience."},{"type":"text","text":"There are exceptions to the rule, though. In some situations, navigating the current tab can be very disruptive, in which case opening a new tab is preferable. For example, a link on a page with a long form could open in a new tab so the user doesn’t lose any data they’ve entered."},{"type":"text","text":"It’s also worth noting that the W3C’s advice against opening links in a new tab is expressed as an informative technique and not a success criteria. In other words, you can ignore this advice and still be fully WCAG 2.0 compliant. I don’t recommend you do that, though."},{"type":"text","text":"Alright, let’s assume you still want to open links in a new tab. Maybe you have one of those situations where a new tab is more accessible, as discussed earlier. Or maybe your boss/client is making you do it. Or maybe you just want to. I’m not here to judge, but I will help you make these links more accessible."},{"type":"html","text":"The important thing is to inform your users if a link will open in a new tab. This helps keep your site predictable, which is important for accessibility."},{"type":"headline","text":"How To Inform Your Users"},{"type":"text","text":"The most straightforward way is to put a message in the link text."},{"type":"code","text":"<a href=\"https://example.com\" target=\"_blank\">\n    example link (opens in a new tab)\n</a>"},{"type":"text","text":"If you don’t like the extra verbiage appearing in your links, then you can tweak things a bit to hide the message visually while keeping it available to screen readers (we’ll discuss adding a visual cue back in later in this article)."},{"type":"code","text":"<a href=\"https://example.com\" target=\"_blank\">\n    example link\n    <span class=\"screen-reader-only\">(opens in a new tab)</span>\n</a>"},{"type":"html","text":"The <span> is styled to hide the text visually, but not from screen readers. There are a lot of ways to do this, but here’s one way."},{"type":"code","text":".screen-reader-only {\n    position: absolute;\n    width: 1px;\n    clip: rect(0 0 0 0);\n    overflow: hidden;\n    white-space: nowrap;\n}"},{"type":"headline","text":"Quick Security Note"},{"type":"codepen","url":"https://codepen.io/lonekorean/embed/arVGbd?height=260&theme-id=35302&default-tab=result&user=lonekorean&slug-hash=arVGbd&pen-title=New%20Tab%20Icon&name=cp_embed_1"}]}